
#===========================================================
#Получить код страницы
#-----------------------------------------------------------
import requests
r = requests.get('https://api.github.com/events')
print (r.status_code)
#===========================================================
#===========================================================
#Получить страницу и обработка ошибки
#-----------------------------------------------------------
import requests

try:
    r = requests.get('https://s1.sharewood.co/online/?type=member')
except requests.ConnectionError:
    print("Нэ могу достучаться да ?")

print (r.text)
#===========================================================